{
    "title": "A new experimental system to bring quantum technologies closer to students",
    "url": "https://phys.org/news/2025-01-experimental-quantum-technologies-closer-students.html",
    "publication_date": "2025-01-28T15:23:43.408704",
    "content": "The expert Raúl Lahoz and a group of students with the new equipment for studying quantum physics. Credit: Fundació Catalunya La Pedrera\nThe world of quantum physics is experiencing a second revolution, which will drive an exponential leap in the progress of computing, the internet, telecommunications, cybersecurity and biomedicine.\nQuantum technologies are attracting more and more students who want to learn about concepts from the subatomic world—such as quantum entanglement or quantum superposition—to explore the innovative potential of quantum science.\nIn fact, understanding the non-intuitive nature of quantum technology concepts and recognizing their relevance to technological progress is one of the challenges of 2025, declared the International Year of Quantum Science and Technology by UNESCO.\nNow, a team from the Faculty of Physics of the University of Barcelona has designed new experimental equipment that makes it possible for students to familiarize themselves with the more complex concepts of quantum physics.\nThe configuration they present—versatile, cost-effective and with multiple methods of application in the classroom—is already operational in the Advanced Quantum Laboratory of the UB's Faculty of Physics and could also be accessible in less specialized centers.\nThis innovation is presented in an article published in the journal EPJ Quantum Technology, which results from a collaboration between professors Bruno Juliá, from the Department of Quantum Physics and Astrophysics and the UB Institute of Cosmos Sciences (ICCUB); Martí Duocastella, from the Department of Applied Physics and the UB Institute of Nanoscience and Nanotechnology (IN2UB), and José M. Gómez, from the Department of Electronic and Biomedical Engineering.\nIt is based on the result of Raúl Lahoz's master's final project, with the participation of experts Lidia Lozano and Adrià Brú.\nStudy of phenomena unique to quantum mechanics\nQuantum mechanics makes it possible to create so-called entangled systems—for example, with two particles or two photons—that behave in a non-intuitive way.\nIn 1964, the physicist John S. Bell experimentally proved that the predictions of quantum mechanics were totally incompatible with a classical description of physics—a hypothesis that had been advocated by Albert Einstein—and consolidated the probabilistic nature of quantum mechanics.\nIn 2022, scientists Alain Aspect, John F. Clauser and Anton Zeilinger were awarded the Nobel Prize in Physics for pioneering experiments in quantum information on entangled photons and the experimental demonstration of the violation of Bell's inequalities.\nQuantum entanglement is today one of the fundamental resources to drive the development of quantum technologies (quantum computers, data encryption, etc.).\n\"The study of Bell inequalities—in particular, observing violations of the inequalities—is fundamental to characterizing quantum entangled systems. It is important to be able to perform these experiments in a teaching laboratory to understand Bell's inequalities, quantum entanglement and the probabilistic nature of quantum mechanics,\" says Juliá.\nDuocastella explains in the article that they have designed \"new experimental equipment capable of providing students with direct measurements of quantum entanglement. From our perspective, we believe that allowing students to make these measurements will greatly facilitate their understanding of this unintuitive phenomenon.\"\nDiscover the latest in science, tech, and space with over 100,000 subscribers who rely on Phys.org for daily insights. Sign up for our free newsletter and get updates on breakthroughs, innovations, and research that matter—daily or weekly.\nSubscribe\nIntroducing students to advanced tools\nThe system designed by the UB team makes it possible to study Bell inequalities and also to perform full two-photon state tomography. With a simple operation, it can prepare different quantum entangled states.\nCompared to previous proposals, \"The new equipment has improved the photon-capture process: it uses detectors assembled to optical fibers, one of the key innovations to simplify the experiment, which facilitates the alignment of the system and increases the efficiency of the detection. Thus, a complete measurement of the Bell inequalities can be performed during a practical laboratory session (between one and two hours),\" say Juliá and Duocastella.\nThe results reveal successful manipulation of the quantum state of photons and the achievement of high-fidelity entangled states and significant violations of Bell inequalities. Also, the elements of the system are widely used in current quantum technologies, facilitating students' contact with advanced instrumentation.\nThis innovation, which has already been applied in bachelor's and master's degree courses, has received very positive feedback from all students. In the bachelor's degree in Physics, it allows experimental demonstrations to be carried out to complement the subject of classical and quantum information theory and quantum mechanics. In the master's degree course, it is one of the four experiments in the Advanced Quantum Laboratory of the Master's degree in Quantum Science and Technologies.\nMore information: Raul Lahoz Sanz et al, Undergraduate setup for measuring the Bell inequalities and performing quantum state tomography, EPJ Quantum Technology (2024). DOI: 10.1140/epjqt/s40507-024-00298-y\nProvided by University of Barcelona",
    "scraped_at": "2025-01-28T15:23:43.409794"
}