{
    "feed_title": "Chemistry News - Biochemistry, Polymers, Materials Science",
    "feed_link": "https://phys.org/chemistry-news/",
    "feed_description": "The latest news stories on chemistry, biochemistry, polymers, materials science from Phys.org",
    "feed_language": "en-us",
    "last_updated": "2025-01-28T16:19:26.897935",
    "articles": [
        {
            "title": "Trimetallic synergy and defects: A catalyst for climate action",
            "link": "https://phys.org/news/2025-01-trimetallic-synergy-defects-catalyst-climate.html",
            "summary": "A study appearing in Proceedings of the National Academy of Sciences introduces a trimetallic catalyst—including nickel (Ni), copper (Cu), and zinc (Zn) nanoparticles supported on defective ceria (CeO2)—that achieves unprecedented performance in CO2 reduction.",
            "published": "Mon, 27 Jan 2025 15:45:56 EST",
            "published_parsed": "2025-01-27 20:45:56",
            "authors": [],
            "tags": [
                "Analytical Chemistry"
            ]
        },
        {
            "title": "Team uses AI and quantum computing to target 'undruggable' cancer protein",
            "link": "https://phys.org/news/2025-01-team-ai-quantum-undruggable-cancer.html",
            "summary": "Research co-led by University of Toronto researchers and Insilico Medicine has demonstrated the potential of quantum computing and artificial intelligence to transform the drug discovery pipeline.",
            "published": "Mon, 27 Jan 2025 14:32:25 EST",
            "published_parsed": "2025-01-27 19:32:25",
            "authors": [],
            "tags": [
                "Biochemistry Analytical Chemistry"
            ]
        },
        {
            "title": "Researchers achieve high-rate and stable ammonia electrosynthesis from nitrate",
            "link": "https://phys.org/news/2025-01-high-stable-ammonia-electrosynthesis-nitrate.html",
            "summary": "Ammonia (NH3) is traditionally produced through the energy-intensive Haber-Bosch process which converts nitrogen (N2) and hydrogen (H2) into NH3 at high temperatures (400–500℃) and pressures (10–30 MPa). This process consumes 1%–2% of global energy and contributes about 1% of global CO2 emissions.",
            "published": "Mon, 27 Jan 2025 13:24:02 EST",
            "published_parsed": "2025-01-27 18:24:02",
            "authors": [],
            "tags": [
                "Analytical Chemistry Materials Science"
            ]
        },
        {
            "title": "A new chemical tool to create efficient carbon-nitrogen bonds, lowering the cost of tomorrow's medicine",
            "link": "https://phys.org/news/2025-01-chemical-tool-efficient-carbon-nitrogen.html",
            "summary": "University of Missouri researchers and collaborators have developed a new chemical tool that could help lower the cost of prescription medications. The tool, called AshPhos, is a ligand, or molecule, that makes it easier to create special carbon-nitrogen bonds. These bonds are the backbone of more than half of all medicines on the market today.",
            "published": "Mon, 27 Jan 2025 12:21:53 EST",
            "published_parsed": "2025-01-27 17:21:53",
            "authors": [],
            "tags": [
                "Biochemistry Analytical Chemistry"
            ]
        },
        {
            "title": "Plant-based alternative for harmful algal bloom mitigation discovered",
            "link": "https://phys.org/news/2025-01-based-alternative-algal-bloom-mitigation.html",
            "summary": "A research team at Clarkson University recently published a study about a plant-based alternative to traditional chemical methods of combating Harmful Algal Blooms (HABs).",
            "published": "Mon, 27 Jan 2025 12:06:51 EST",
            "published_parsed": "2025-01-27 17:06:51",
            "authors": [],
            "tags": [
                "Biochemistry Analytical Chemistry"
            ]
        },
        {
            "title": "Electrochemical X-ray scattering unlocks secrets of redox enzymes",
            "link": "https://phys.org/news/2025-01-electrochemical-ray-secrets-redox-enzymes.html",
            "summary": "Redox enzymes are proteins that catalyze oxidation-reduction reactions, which involve the transfer of electrons between molecules. Redox enzymes are crucial in bioelectrochemical devices, such as biosensors or biofuel cells. For instance, biosensors catalyze reactions that convert biochemical signals into measurable electrical signals, enabling the detection of substances like glucose.",
            "published": "Mon, 27 Jan 2025 11:50:04 EST",
            "published_parsed": "2025-01-27 16:50:04",
            "authors": [],
            "tags": [
                "Biochemistry Analytical Chemistry"
            ]
        },
        {
            "title": "New dyes pave way for better photothermal cancer treatment and diagnosis",
            "link": "https://phys.org/news/2025-01-dyes-pave-photothermal-cancer-treatment.html",
            "summary": "Researchers from Tokyo Metropolitan University have developed a new dye that can strongly absorb second near-IR radiation and transform it to heat. Starting with a dye from the bile pigment family, they designed a unique ring structure which can bind rhodium and iridium.",
            "published": "Mon, 27 Jan 2025 11:24:04 EST",
            "published_parsed": "2025-01-27 16:24:04",
            "authors": [],
            "tags": [
                "Biochemistry Analytical Chemistry"
            ]
        },
        {
            "title": "Streamlined protocol reveals chemical structure of cellular proteins on a large scale",
            "link": "https://phys.org/news/2025-01-protocol-reveals-chemical-cellular-proteins.html",
            "summary": "In living organisms, protein molecules with different chemical structures called proteoforms, are produced from a single gene to perform a variety of physiological protein functions. It has been known for quite some time that humans have approximately 22,000 genes, but the total number of human proteoforms is still unknown.",
            "published": "Mon, 27 Jan 2025 11:07:03 EST",
            "published_parsed": "2025-01-27 16:07:03",
            "authors": [],
            "tags": [
                "Biochemistry Analytical Chemistry"
            ]
        },
        {
            "title": "Mechanochemical synthesis: New theory explains reaction rate acceleration",
            "link": "https://phys.org/news/2025-01-mechanochemical-synthesis-theory-reaction.html",
            "summary": "In contrast to conventional organic synthesis, mechanochemistry does not use solvents that eventually become industrial wastes. Thus, mechanochemistry is environmentally friendly and enables us to perform organic synthesis using reactants that poorly dissolve into common solvents.",
            "published": "Fri, 24 Jan 2025 11:35:03 EST",
            "published_parsed": "2025-01-24 16:35:03",
            "authors": [],
            "tags": [
                "Analytical Chemistry Materials Science"
            ]
        },
        {
            "title": "Reaction pathways of carbon dioxide in supercritical water revealed",
            "link": "https://phys.org/news/2025-01-reaction-pathways-carbon-dioxide-supercritical.html",
            "summary": "A research team has made significant discoveries regarding the complex reaction mechanisms of carbon dioxide (CO₂) in supercritical water. These findings are crucial for understanding the molecular mechanisms of CO₂ mineralization and sequestration in nature and engineering, as well as the deep carbon cycle within the Earth's interior. This understanding will help pave the way for new directions in future carbon sequestration technologies. The study was published in the Proceedings of the National Academy of Sciences.",
            "published": "Fri, 24 Jan 2025 10:55:04 EST",
            "published_parsed": "2025-01-24 15:55:04",
            "authors": [],
            "tags": [
                "Analytical Chemistry"
            ]
        },
        {
            "title": "Improving ammonia synthesis: New iron-based catalyst surpasses century-old benchmark",
            "link": "https://phys.org/news/2025-01-ammonia-synthesis-iron-based-catalyst.html",
            "summary": "NH3 is one of the most important chemicals in today's world, as it is used in the production of fertilizers to boost agricultural yields and sustain the ever-growing global population. For over 100 years, NH3 production has relied on the Haber–Bosch (HB) process, which combines nitrogen (N2) and hydrogen in the presence of a catalyst.",
            "published": "Fri, 24 Jan 2025 09:40:04 EST",
            "published_parsed": "2025-01-24 14:40:04",
            "authors": [],
            "tags": [
                "Analytical Chemistry Materials Science"
            ]
        },
        {
            "title": "Improving the performance of biosensors: New material effectively harnesses the power of enzymes",
            "link": "https://phys.org/news/2025-01-biosensors-material-effectively-harnesses-power.html",
            "summary": "Researchers at the University of Tsukuba have developed a new material that harnesses the power of enzymes more effectively. These materials have improved the reaction efficiency and long-term stability of enzymes in electrochemical biosensors used in health care and other applications. Furthermore, the researchers significantly enhanced device performance.",
            "published": "Fri, 24 Jan 2025 09:07:49 EST",
            "published_parsed": "2025-01-24 14:07:49",
            "authors": [],
            "tags": [
                "Biochemistry Materials Science"
            ]
        },
        {
            "title": "Cracking the code: Why platinum electrodes corrode",
            "link": "https://phys.org/news/2025-01-code-platinum-electrodes-corrode.html",
            "summary": "Scientists from Leiden University and the Department of Energy's SLAC National Laboratory have uncovered the mysterious cause behind the rapid corrosion of platinum electrodes. This study paves the way for more affordable green hydrogen production and more reliable electrochemical sensors.",
            "published": "Fri, 24 Jan 2025 06:57:03 EST",
            "published_parsed": "2025-01-24 11:57:03",
            "authors": [],
            "tags": [
                "Analytical Chemistry Materials Science"
            ]
        },
        {
            "title": "Protein denaturation provides a path toward more sustainable 3D printing of photoresins",
            "link": "https://phys.org/news/2025-01-protein-denaturation-path-sustainable-3d.html",
            "summary": "The vast majority of photoresins for 3D printing (also referred to as additive manufacturing or AM) and related technologies are toxic, non-biodegradable, and sourced from unsustainable feedstocks. Non-traditional approaches to 3D printing offer a way to break free of the traditional confines of unsustainable petroleum-based reagents and chemical methods that require toxic monomers.",
            "published": "Thu, 23 Jan 2025 15:36:13 EST",
            "published_parsed": "2025-01-23 20:36:13",
            "authors": [],
            "tags": [
                "Biochemistry Materials Science"
            ]
        },
        {
            "title": "By the numbers: Diarylethene crystal orientation controlled for first time",
            "link": "https://phys.org/news/2025-01-diarylethene-crystal.html",
            "summary": "Photomechanical materials made of photochromic crystals, which change their molecular structure reversibly in response to light, have the potential to impact fields from semiconductors to pharmaceuticals. For the first time in the world, an Osaka Metropolitan University team has developed a crystal patterning method demonstrating that it is possible to control the orientation of photochromic crystals known as diarylethenes.",
            "published": "Thu, 23 Jan 2025 11:45:03 EST",
            "published_parsed": "2025-01-23 16:45:03",
            "authors": [],
            "tags": [
                "Analytical Chemistry Materials Science"
            ]
        },
        {
            "title": "Computational tool designs proteins with water-mediated interactions in mind",
            "link": "https://phys.org/news/2025-01-tool-proteins-interactions-mind.html",
            "summary": "Proteins are life's engines, powering processes like muscle movement, vision, and chemical reactions. Their environments—water, lipid membranes, or other condensed phases—are critical to their function, shaping their structure and interactions.",
            "published": "Thu, 23 Jan 2025 11:25:04 EST",
            "published_parsed": "2025-01-23 16:25:04",
            "authors": [],
            "tags": [
                "Biochemistry Analytical Chemistry"
            ]
        },
        {
            "title": "Artificial photosynthesis decoded: How carbon nitride splits water (and enables green hydrogen)",
            "link": "https://phys.org/news/2025-01-artificial-photosynthesis-decoded-carbon-nitride.html",
            "summary": "Scientists have long sought to understand the exact mechanism behind water splitting by carbon nitride catalysts. For the first time, Dr. Paolo Giusto and his team captured the step-by-step interactions at the interface between carbon nitride and water, detailing the transfer of protons and electrons from water to the catalyst under light.",
            "published": "Thu, 23 Jan 2025 09:40:03 EST",
            "published_parsed": "2025-01-23 14:40:03",
            "authors": [],
            "tags": [
                "Analytical Chemistry Materials Science"
            ]
        },
        {
            "title": "Antimony's bonding characteristics offer insights into phase change materials",
            "link": "https://phys.org/news/2025-01-antimony-bonding-characteristics-insights-phase.html",
            "summary": "A new study that provides unprecedented insights into the chemical bonding of antimony could have a profound impact on materials research. The collaboration between scientists from Leipzig University, RWTH Aachen University and the DESY synchrotron in Hamburg combined experimental measurements with theoretical calculations.",
            "published": "Wed, 22 Jan 2025 15:55:02 EST",
            "published_parsed": "2025-01-22 20:55:02",
            "authors": [],
            "tags": [
                "Analytical Chemistry Materials Science"
            ]
        },
        {
            "title": "Researchers report the first-ever total synthesis of a promising mushroom-derived compound",
            "link": "https://phys.org/news/2025-01-total-synthesis-mushroom-derived-compound.html",
            "summary": "Natural compounds from plants and animals have long been used in drug development, but mushrooms remain underexplored despite their rich chemical potential. Now, researchers from Japan have successfully developed the first method to synthesize inaoside A, a compound derived from the edible mushroom Laetiporus cremeiporus. This achievement will help better understand more of its bioactive properties and pave the way for similar mushroom-derived compounds in pharmaceuticals and functional foods.",
            "published": "Wed, 22 Jan 2025 12:50:53 EST",
            "published_parsed": "2025-01-22 17:50:53",
            "authors": [],
            "tags": [
                "Biochemistry"
            ]
        },
        {
            "title": "Copper-detection tool discovers possible chelation target for lung cancer",
            "link": "https://phys.org/news/2025-01-copper-tool-chelation-lung-cancer.html",
            "summary": "The Chang Lab at Princeton Chemistry continues in its mission to elucidate the role of metal nutrients in human biology: last year, iron; this year, copper. The lab's first paper of 2025 showcases its development of a revelatory sensing probe for the detection of copper in human cells and then wields it to uncover how copper may be regulating cell growth in lung cancer.",
            "published": "Wed, 22 Jan 2025 12:23:05 EST",
            "published_parsed": "2025-01-22 17:23:05",
            "authors": [],
            "tags": [
                "Biochemistry Analytical Chemistry"
            ]
        },
        {
            "title": "Superalloys resist wear at nearly forge-level heat using new process",
            "link": "https://phys.org/news/2025-01-superalloys-resist-forge.html",
            "summary": "Finding lubricants that work at exceptionally high temperatures challenges researchers and industries alike. A Virginia Tech team may have uncovered a promising candidate by happenstance: transition metal spinel oxides formed on nickel-chromium-based superalloys.",
            "published": "Wed, 22 Jan 2025 10:22:04 EST",
            "published_parsed": "2025-01-22 15:22:04",
            "authors": [],
            "tags": [
                "Materials Science"
            ]
        },
        {
            "title": "Ceramic catalyst uses sodium and boron to drive sustainable industrial reactions",
            "link": "https://phys.org/news/2025-01-ceramic-catalyst-sodium-boron-sustainable.html",
            "summary": "Heterogeneous catalysts speed up chemical reactions by being in a different state than the reactants. They are efficient and stable, even under challenging conditions such as high temperature or pressure. Traditionally, metals like iron, platinum, and palladium have been widely used in industries like petrochemicals and agriculture for important reactions such as hydrogenation and Haber's process.",
            "published": "Tue, 21 Jan 2025 12:14:05 EST",
            "published_parsed": "2025-01-21 17:14:05",
            "authors": [],
            "tags": [
                "Analytical Chemistry Materials Science"
            ]
        },
        {
            "title": "Electrochemical process recycles CO₂ from flue gases with just 2% concentration",
            "link": "https://phys.org/news/2025-01-electrochemical-recycles-flue-gases.html",
            "summary": "Design and process control are the be-all and end-all when it comes to reducing CO2 from flue gases or the atmosphere. In order to protect the climate, the aim is to recover CO2 from combustion processes for valuable materials. This is challenging because there are other gases in flue gases besides CO2.",
            "published": "Tue, 21 Jan 2025 12:00:02 EST",
            "published_parsed": "2025-01-21 17:00:02",
            "authors": [],
            "tags": [
                "Analytical Chemistry"
            ]
        },
        {
            "title": "Water boosts catalytic recycling efficiency for plastic waste",
            "link": "https://phys.org/news/2025-01-boosts-catalytic-recycling-efficiency-plastic.html",
            "summary": "Plastics are undeniably useful materials that have found their way into virtually all human activities. However, with yearly global plastic production exceeding 400 million tons, the environmental threat posed by increased plastic consumption and disposal, contributing to its pollution, is also bigger than ever. Considering that only one-tenth of all plastic waste is recycled, new technologies that can help tackle this growing problem are urgently required.",
            "published": "Tue, 21 Jan 2025 11:41:04 EST",
            "published_parsed": "2025-01-21 16:41:04",
            "authors": [],
            "tags": [
                "Polymers Analytical Chemistry"
            ]
        },
        {
            "title": "Innovative technique flips chemical polarity for targeted drug creation",
            "link": "https://phys.org/news/2025-01-technique-flips-chemical-polarity-drug.html",
            "summary": "Researchers at Leipzig University have developed a new process for reversing the polarity of chemical compounds, also known as umpolung, for the precise synthesis of pharmaceuticals.",
            "published": "Tue, 21 Jan 2025 10:34:04 EST",
            "published_parsed": "2025-01-21 15:34:04",
            "authors": [],
            "tags": [
                "Biochemistry Materials Science"
            ]
        },
        {
            "title": "Chemical research often contains inaccurate mass measurement data, according to AI analysis",
            "link": "https://phys.org/news/2025-01-chemical-inaccurate-mass-ai-analysis.html",
            "summary": "AI-powered data analysis tools have the potential to significantly improve the quality of scientific publications. A new study by Professor Mathias Christmann, a chemistry professor at Freie Universität Berlin, has uncovered shortcomings in chemical publications.",
            "published": "Mon, 20 Jan 2025 15:46:03 EST",
            "published_parsed": "2025-01-20 20:46:03",
            "authors": [],
            "tags": [
                "Analytical Chemistry"
            ]
        },
        {
            "title": "Using infrared heat transfer to modify chemical reactions",
            "link": "https://phys.org/news/2025-01-infrared-chemical-reactions.html",
            "summary": "In a joint experimental-theoretical work, a team of researchers, including theorists from UC San Diego, have shown for the first time that heat transfer in the form of infrared radiation can influence chemical reactions more strongly than traditional convection and conduction methods.",
            "published": "Mon, 20 Jan 2025 13:09:01 EST",
            "published_parsed": "2025-01-20 18:09:01",
            "authors": [],
            "tags": [
                "Analytical Chemistry Materials Science"
            ]
        },
        {
            "title": "Predictive descriptor unlocks high-performance nanozymes for peroxidase-like activity",
            "link": "https://phys.org/news/2025-01-descriptor-high-nanozymes-peroxidase.html",
            "summary": "In a new study, Professor Hui Wei and coworkers have introduced a predictive descriptor—t2 occupancy—to guide the design of spinel oxide-based nanozymes with enhanced peroxidase-like (POD) activity.",
            "published": "Mon, 20 Jan 2025 11:54:35 EST",
            "published_parsed": "2025-01-20 16:54:35",
            "authors": [],
            "tags": [
                "Analytical Chemistry Materials Science"
            ]
        },
        {
            "title": "How a pervasive microorganism generates a greenhouse gas",
            "link": "https://phys.org/news/2025-01-pervasive-microorganism-generates-greenhouse-gas.html",
            "summary": "Cornell researchers have discovered a way for ammonia oxidizing archaea (AOA), one of the most abundant types of microorganisms on Earth, to produce nitrous oxide, a potent and long-lasting greenhouse gas.",
            "published": "Mon, 20 Jan 2025 10:22:04 EST",
            "published_parsed": "2025-01-20 15:22:04",
            "authors": [],
            "tags": [
                "Biochemistry Analytical Chemistry"
            ]
        },
        {
            "title": "Polymer editing can upcycle waste into higher-performance plastics",
            "link": "https://phys.org/news/2025-01-polymer-upcycle-higher-plastics.html",
            "summary": "By editing the polymers of discarded plastics, chemists at the Department of Energy's Oak Ridge National Laboratory have found a way to generate new macromolecules with more valuable properties than those of the starting material. Upcycling may help remedy the roughly 450 million tons of plastic discarded worldwide annually, of which only 9% gets recycled; the rest is incinerated or winds up in landfills, oceans or elsewhere.",
            "published": "Fri, 17 Jan 2025 12:32:05 EST",
            "published_parsed": "2025-01-17 17:32:05",
            "authors": [],
            "tags": [
                "Polymers Analytical Chemistry"
            ]
        }
    ]
}